{
  "intents": [
    {
      "tag": "B0",
      "patterns": ["What is PixelCode?", "Tell me about this website"],
      "responses": [
        "PixelCode is a developer-focused learning platform built by Kundan. It offers the Striver DSA Sheet with an integrated code editor to practice, run, and submit code seamlessly. It also features top-quality tutorials in DSA, DBMS, OS, CN, and more."
      ]
    },
    {
      "tag": "B1",
      "patterns": [
        "Who developed PixelCode?",
        "Who is the creator of PixelCode?"
      ],
      "responses": [
        "PixelCode is developed by Kundan Kumar, a passionate developer dedicated to helping students master technical subjects effectively."
      ]
    },
    {
      "tag": "B2",
      "patterns": [
        "What can I learn on PixelCode?",
        "What subjects does PixelCode cover?"
      ],
      "responses": [
        "PixelCode offers educational content focused on core Computer Science subjects such as Data Structures and Algorithms (DSA), DBMS, Operating Systems, Computer Networks, and more."
      ]
    },
    {
      "tag": "B3",
      "patterns": [
        "Is the Striver DSA sheet available?",
        "Can I practice Striver's DSA sheet here?"
      ],
      "responses": [
        "Yes! PixelCode features the complete Striver DSA Sheet along with a built-in code editor where you can write, run, and submit your solutions."
      ]
    },
    {
      "tag": "B4",
      "patterns": [
        "Is there a code editor on this site?",
        "Can I code directly on PixelCode?"
      ],
      "responses": [
        "Absolutely! PixelCode includes a powerful in-browser code editor that supports multiple languages, allowing you to run and submit code efficiently."
      ]
    },
    {
      "tag": "B5",
      "patterns": [
        "Is this website free?",
        "Do I need to pay to use PixelCode?"
      ],
      "responses": [
        "Yes, PixelCode is completely free to use. Just sign up and start learning!"
      ]
    },
    {
      "tag": "B6",
      "patterns": [
        "How do I register?",
        "How can I create an account on PixelCode?"
      ],
      "responses": [
        "To register, visit the Sign Up page, enter your details, and you're ready to go!"
      ]
    },
    {
      "tag": "B7",
      "patterns": [
        "Can I track my progress?",
        "Does this site save my submissions?"
      ],
      "responses": [
        "Yes, PixelCode keeps track of your progress and submissions, helping you stay on top of your preparation."
      ]
    },
    {
      "tag": "B8",
      "patterns": [
        "What makes PixelCode different?",
        "Why should I use PixelCode?"
      ],
      "responses": [
        "PixelCode stands out for its smooth code editor, real-time submission tracking, curated content like Striver's DSA sheet, and rich tutorials crafted to simplify complex technical topics."
      ]
    },
    {
      "tag": "B9",
      "patterns": [
        "Are there tutorials available?",
        "Can I learn DBMS or OS here?"
      ],
      "responses": [
        "Yes! PixelCode offers easy-to-follow tutorials on DSA, DBMS, OS, CN, and other computer science core subjects."
      ]
    },
    {
      "tag": "B10",
      "patterns": [
        "Can I contribute content?",
        "Can I upload questions or tutorials?"
      ],
      "responses": [
        "Currently, content contribution is limited, but stay tuned! We plan to open community contributions soon."
      ]
    },
    {
      "tag": "B11",
      "patterns": ["How do I reset my password?", "I forgot my password"],
      "responses": [
        "To reset your password, visit the login page and click on 'Forgot Password'. Follow the instructions to reset it."
      ]
    },
    {
      "tag": "B12",
      "patterns": ["How can I contact support?", "Is there a support team?"],
      "responses": [
        "You can contact us anytime at support@pixelcode.com. We’re happy to help!"
      ]
    },
    {
      "tag": "B13",
      "patterns": ["Can I use this on my phone?", "Is there a mobile version?"],
      "responses": [
        "Yes, PixelCode is mobile-friendly. A mobile app is also under development!"
      ]
    }
  ]
}
